app/controllers/admin_controller.rb

INSERT INTO "configuracaos" ("comissao_padrao", "comissao_assinante", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comissao_padrao", 6.0], ["comissao_assinante", 3.0], ["created_at", "2025-07-21 18:00:03.511501"], ["updated_at", "2025-07-21 18:00:03.511501"]]
SELECT "configuracaos".* FROM "configuracaos" ORDER BY "configuracaos"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @config = Configuracao.first_or_create(comissao_padrao: 6.0, comissao_assinante: 3.0)