app/controllers/bolsao_controller.rb

SELECT "fretes".* FROM "fretes" WHERE "fretes"."status" = $1  [["status", "aberto"]]
SELECT 1 AS one FROM "fretes" WHERE "fretes"."status" = $1 LIMIT $2  [["status", "aberto"], ["LIMIT", 1]]
---
  def index
    @fretes = Frete.where(status: 'aberto').includes(:cliente)

    # Filtros (via params do modal)
    @fretes = @fretes.where(cep_origem: params[:cep_origem]) if params[:cep_origem].present?