app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all # Busca todos os clientes do banco de dados.
  end
---
SELECT "clientes".* FROM "clientes"

  def create
    @cliente = Cliente.new(cliente_params) # Instancia com os parâmetros permitidos.

    if @cliente.save # Tenta salvar o novo cliente no banco de dados.
      redirect_to @cliente, notice: "Cliente criado com sucesso." # Redireciona para a página de exibição com uma mensagem de sucesso.
    else
---
INSERT INTO "clientes" ("nome", "email", "created_at", "updated_at", "telefone", "endereco", "cep", "largura", "altura", "profundidade", "peso_aproximado", "observacoes", "alba_numero", "whatsapp", "cpf") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def set_cliente
    @cliente = Cliente.find(params[:id]) # Encontra o cliente pelo ID a partir dos parâmetros da URL.
  end
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]