app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params) # Cria um novo objeto Cliente com os parâmetros permitidos.

    if @cliente.save # Tenta salvar o cliente no banco de dados.
      # Se o salvamento for bem-sucedido, redireciona o usuário para a lista de clientes
---
INSERT INTO "clientes" ("nome", "email", "created_at", "updated_at", "telefone", "endereco", "cep") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["nome", "ddddds"], ["email", "sssdss2@dsdsds"], ["created_at", "2025-07-13 05:28:01.470481"], ["updated_at", "2025-07-13 05:28:01.470481"], ["telefone", nil], ["endereco", nil], ["cep", nil]]