app/controllers/fidelidade_controller.rb

SELECT COUNT(*) FROM "fretes" WHERE "fretes"."transportador_id" = $1 AND "fretes"."entregue" = $2  [["transportador_id", 1], ["entregue", true]]
---
  def transportador
    @transportador = Transportador.find(params[:id])
    # Pontos baseados em entregas com sucesso
    @pontos = @transportador.fretes.where(entregue: true).count * 15