app/controllers/fretes_controller.rb

  def create
    @frete = Frete.new(frete_params)

    # Cálculo local defensivo (NUNCA quebra fluxo)
    if @frete.respond_to?(:calcular_valor) && @frete.valor.blank?
      begin
        @frete.valor = @frete.calcular_valor
      rescue StandardError => e
        Rails.logger.warn("[FretesController#create] Cálculo local falhou: #{e.message}")
      end
    end

    if @frete.save
---
INSERT INTO "fretes" ("cliente_id", "transportador_id", "volume", "ponto_referencia", "horario_entrega", "previsao_chegada", "previsao_km", "valor_total", "aceite_responsabilidade", "created_at", "updated_at", "cep_origem", "cep_destino", "peso", "distancia", "valor_estimado", "latitude", "longitude", "cep_atual", "latitude_atual_transportador", "longitude_atual_transportador", "origem", "destino", "descricao", "largura", "altura", "profundidade", "status", "contatos_liberados", "entregue", "cliente_nome") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31) RETURNING "id"

  def set_frete
    @frete = Frete.find_by(id: params[:id])
    return if @frete.present?
---
SELECT "fretes".* FROM "fretes" WHERE "fretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "fretes".* FROM "fretes"