app/controllers/modals_controller.rb

  def create
    @modal = Modal.new(modal_params)

    if @modal.save
---
INSERT INTO "modals" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "Caminhão"], ["created_at", "2025-07-27 19:55:02.285409"], ["updated_at", "2025-07-27 19:55:02.285409"]]

    def set_modal
      @modal = Modal.find(params[:id])
---
SELECT "modals".* FROM "modals" WHERE "modals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]