app/controllers/ranking_controller.rb

SELECT COUNT(*) FROM "fretes" WHERE "fretes"."transportador_id" = $1 AND "fretes"."entregue" = $2  [["transportador_id", 1], ["entregue", true]]
---
  def index
    @top_transportadores = Transportador.all.sort_by { |t| -t.fretes.where(entregue: true).count }.first(10)